export const MULTI_CHOICE_STEPS = [
  "여러 선택지 중에서 고민 중이구나?",
  "고민하고 있는 모든 선택지를 적어줘.",
  "결정토끼가 네 선택을 도와줄게!",
] as const;

export const MULTI_CHOICE_ANSWERS = [
  "다른 선택지도 좋지만, 아무래도 이 선택지가 지금 상황에 더 도움이 될 거라는 느낌이 뽝! 하고 오네.\n\n 그 선택이 네 하루에 행운을 가져다 줄 거야!",
  "다른 선택지도 괜찮지만, 이 선택이 네게 더 맞을 것 같아.\n\n이 선택을 통해 원하는 결과를 맞이하길 바랄게!",
  "다른 선택지도 매력적이지만, 지금 이 순간엔 이 선택만한 게 없을 것 같아.\n\n뭐가 됐든지간에 이 선택으로 인해 좋은 일이 일어날 거야. 가자~!",
  "물론 다른 선택들도 충분히 고려할 만하지만, 이 선택지를 고르면 분명히 좋은 일이 생길 거야. 가보자구!",
  "다른 선택지도 있지만, 지금의 네 상황에 가장 적합한 건 바로 이 선택지야. \n\n이 선택 덕분에 네 하루에 좋은 일이 생길 거야.",
  "다른 선택도 나쁘진 않지만, 이 선택이 너를 더 행복하게 해줄 가능성이 커 보여.",
] as const;
