export const YESNO_STEPS = [
  "할까, 말까 고민하는 문제가 있지?",
  "마음 속 결정하기 어려운 이야기를 적어 줘.",
  "결정토끼가 선택을 도와줄게.",
] as const;

export const YES_ANSWERS = [
  "네 이야기를 들어보니까, 느낌이 딱 왔어. 내 생각엔 한번 시도해보는 게 좋을 것 같아. \n\n지금 안 하면 나중에 '그때 해볼걸...' 하고 후회할 거야. 지금 바로 가보자고!",
  "그 설레는 마음... 그게 바로 네가 진짜 원하는 거라는 신호일 수 있어. \n\n겁나고 두려운 건 당연해. 하지만 용기를 내서 시작해보는 건 어때?",
  "너의 고민이 정말 이해가 돼. 근데 있잖아, 내 직감으로는 해보는 게 좋을 것 같아! \n\n혹시 원하지 않는 결과를 마주하더라도, 그 경험이 너에게 의미 있을 거야.",
  "네가 이렇게 고민하는 것 자체가, 그만큼 해보고 싶은 마음이 크다는 뜻일 것 같아. \n\n때로는 우리의 직감이 정답을 알고 있더라구. 한번 믿어보는 건 어떨까? 분명 좋은 결과가 있을 거야!",
  "이건 무조건 예스야! 당장 진행시켜. \n\n물론 최종 결정은 네가 하는 거니까 부담 갖지 마! 어떤 선택을 하든 난 네 편이야.",
  "네가 생각하고 있는 거, 얼른 진행해! 인생은 생각보다 짧아. \n\n너무 많은 걱정에 발목 잡히지 말고, 네가 원하는 걸 시작해 봐!",
  "너의 이야기를 들어보니까, 네 마음 속엔 이미 답이 있는 것 같아.\n\n 하고 싶은데 확신이 필요한 거겠지? 해보고 싶은 마음이 있다면, 그게 바로 답일 수 있어. 넌 잘 할 수 있을 거야, 믿어 봐!",
] as const;

export const NO_ANSWERS = [
  "음... 지금은 조금 더 신중하게 생각해보는 게 좋을 것 같아. \n\n서두를 필요 없어. 더 좋은 기회가 올 수도 있으니까, 차분하게 고민해보자. 내가 옆에서 같이 생각해줄게.",
  "잠깐! 이건 NO라고 말해주고 싶어.\n\n근데 알아? 준비되지 않은 상태에서 시작하는 것보다, 더 단단해진 다음에 도전하는 게 성공 확률이 높더라구!\n\n이 시간 동안 네가 원하는 걸 더 구체적으로 그려보자.",
  "지금은 때가 아닌 것 같아... 억지로 결정하려고 하지 말고, 다른 방법은 없는지 천천히 찾아보자. \n\n네가 준비됐다고 느낄 때까지 기다려도 늦지 않아.",
  "일단 계획을 실행으로 옮기는 건 보류하자. \n\n고민이 많이 되는 걸 보니, 아직은 조금 더 생각해볼 필요가 있을 것 같아.\n\n 결정을 서두르다가 후회하는 것보다, 시간을 두고 천천히 생각해보는 게 더 현명할 것 같아.",
  "지금은 '아니오'라고 말해주고 싶어.\n\n'NO'라는 결정이 때로는 인생에서 가장 현명한 선택이 되기도 해. ",
  "음... 지금은 하지 않는 게 더 좋은 선택일 것 같아.\n\n이게 바로 네 미래를 위한 현명한 판단이 될 수 있어! 모든 문이 닫힐 때는 더 큰 문이 열리려는 신호일 수 있거든.",
] as const;

export const INVALID_MESSAGE =
  "네 고민이 정말 힘들고 무거운 걸 알아. 하지만 그건 내가 대신 결정해줄 수 없는 문제인 것 같아.\n\n 혹시 주변 친구나 가족, 또는 전문가와 이야기를 나눠보는 건 어떨까? 더 전문적이고 현명한 조언을 받을 수 있을 거야. 😢" as const;
